{
    "jobs": [
      {
        "id": "1",
        "title": "Data Engineer",
        "type": "Full-Time",
        "description": "AFL-CIO is seeking a skilled Data Engineer to support our data infrastructure and analytics needs. The ideal candidate will have experience with SQL, Python, and cloud-based data pipelines.",
        "location": "Washington, DC",
        "salary": "$85K - $100K",
        "org": {
          "name": "AFL-CIO",
          "description": "The American Federation of Labor and Congress of Industrial Organizations (AFL-CIO) is a federation of labor unions dedicated to improving the lives of working people.",
          "email": "jobs@aflcio.org",
          "phone": "202-555-1234"
        }
      },
      {
        "id": "2",
        "title": "Union Organizer",
        "type": "Full-Time",
        "description": "AFSCME is looking for a passionate Union Organizer to recruit and support workers in organizing campaigns. Candidates should have experience in grassroots organizing and a strong commitment to labor rights.",
        "location": "Chicago, IL",
        "salary": "$60K - $75K",
        "org": {
          "name": "AFSCME",
          "description": "The American Federation of State, County and Municipal Employees (AFSCME) is the nation’s largest public services employees union.",
          "email": "careers@afscme.org",
          "phone": "312-555-5678"
        }
      },
      {
        "id": "3",
        "title": "Control Systems Engineer",
        "type": "Full-Time",
        "description": "IEEE is hiring a Control Systems Engineer to develop automation solutions and optimize electrical systems for industrial applications.",
        "location": "New York, NY",
        "salary": "$90K - $110K",
        "org": {
          "name": "IEEE",
          "description": "The Institute of Electrical and Electronics Engineers (IEEE) is a professional association dedicated to advancing technology for the benefit of humanity.",
          "email": "hiring@ieee.org",
          "phone": "212-555-9876"
        }
      },
      {
        "id": "4",
        "title": "Journeyman Electrician",
        "type": "Full-Time",
        "description": "IBEW Local 3 is seeking a Journeyman Electrician to work on commercial and industrial projects. Must have a valid journeyman license and OSHA certification.",
        "location": "Los Angeles, CA",
        "salary": "$80K - $95K",
        "org": {
          "name": "IBEW Local 3",
          "description": "The International Brotherhood of Electrical Workers (IBEW) Local 3 represents skilled electricians and electrical workers across multiple industries.",
          "email": "jobs@ibew3.org",
          "phone": "213-555-2468"
        }
      },
      {
        "id": "5",
        "title": "Labor Representative",
        "type": "Full-Time",
        "description": "The SEIU is hiring a Labor Representative to advocate for workers, negotiate contracts, and handle disputes. Prior experience in labor relations and collective bargaining is required.",
        "location": "Seattle, WA",
        "salary": "$75K - $90K",
        "org": {
          "name": "SEIU",
          "description": "The Service Employees International Union (SEIU) represents over two million workers in healthcare, property services, and public services.",
          "email": "recruitment@seiu.org",
          "phone": "206-555-3345"
        }
      },
      {
        "id": "6",
        "title": "Heavy Equipment Mechanic",
        "type": "Full-Time",
        "description": "IUOE Local 150 is looking for an experienced Heavy Equipment Mechanic to maintain and repair construction machinery. Experience with hydraulics and diesel engines is preferred.",
        "location": "Detroit, MI",
        "salary": "$70K - $85K",
        "org": {
          "name": "IUOE Local 150",
          "description": "The International Union of Operating Engineers (IUOE) Local 150 represents heavy equipment operators, mechanics, and technical engineers.",
          "email": "hr@iuoe150.org",
          "phone": "313-555-7789"
        }
      }
    ]
  }